# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [5]:
# your answer here
employee = pd.read_csv("./data/Employee.csv")
# Turn everying to snake_case
employee.columns = list(map(lambda x: x.lower(), employee.columns))
employee.columns = employee.columns.str.replace(' ','_')

In [20]:
employee

     name department education gender      title  years  salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [12]:
# Method 1
display(employee.groupby(['department']).agg({'salary':np.average}))
display(employee.pivot_table(index = ['department'],values = ['salary'], aggfunc = ['mean']))

            salary
department
HR           45.00
IT           48.75
Sales        55.00

             mean
           salary
department
HR          45.00
IT          48.75
Sales       55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [15]:
# Method 2
display(employee.groupby(['department','title']).agg({'salary':np.average}))
# pivot tables
display(employee.pivot_table(index = ['department','title'],values = ['salary'], aggfunc = ['mean']))
# other way
display(employee.pivot_table(index = ['department'],columns=['title'],values = ['salary'], aggfunc = ['mean']))

                      salary
department title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

                       mean
                     salary
department title
HR         VP          70.0
           analyst     32.5
IT         VP          70.0
           analyst     32.5
           associate   60.0
Sales      associate   55.0

             mean
           salary
title          VP analyst associate
department
HR           70.0    32.5       NaN
IT           70.0    32.5      60.0
Sales         NaN     NaN      55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [18]:
# groupby
display(employee.groupby(['title']).agg({'years':np.average,'salary':np.average}))
# pivot tables
display(employee.pivot_table(index = ['title'],values = ['years','salary'], aggfunc = ['mean']))
# other way

           years     salary
title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

                mean
              salary years
title
VP         70.000000  8.00
analyst    32.500000  2.25
associate  56.666667  4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [30]:
# groupby
aux= employee.groupby(['department','title']).agg({'years':len,'salary':np.average})
aux.columns =['n_employees','salary']
display(aux)
# pivot tables
aux = employee.pivot_table(index = ['department','title'],values = ['years','salary'], aggfunc = {'years':'count','salary':'mean'})
aux.columns =['salary','n_employees']
display(aux[['n_employees','salary']])

                      n_employees  salary
department title
HR         VP                   1    70.0
           analyst              2    32.5
IT         VP                   1    70.0
           analyst              2    32.5
           associate            1    60.0
Sales      associate            2    55.0

                      n_employees  salary
department title
HR         VP                   1    70.0
           analyst              2    32.5
IT         VP                   1    70.0
           analyst              2    32.5
           associate            1    60.0
Sales      associate            2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [42]:
# groupby
aux = employee.groupby(['department','title']).agg({'salary':[np.median,min,max,np.std]})
display(aux)
# pivot tables
display(employee.pivot_table(index = ['department','title'],values = ['salary'], aggfunc = {'salary':[np.mean,min,max,np.std]}))

                     salary
                     median min max       std
department title
HR         VP          70.0  70  70       NaN
           analyst     32.5  30  35  3.535534
IT         VP          70.0  70  70       NaN
           analyst     32.5  30  35  3.535534
           associate   60.0  60  60       NaN
Sales      associate   55.0  55  55  0.000000

                     salary
                        max  mean min       std
department title
HR         VP            70  70.0  70       NaN
           analyst       35  32.5  30  3.535534
IT         VP            70  70.0  70       NaN
           analyst       35  32.5  30  3.535534
           associate     60  60.0  60       NaN
Sales      associate     55  55.0  55  0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [52]:
# We only have one element for VPs and IT associates, so I think the std is not defined.
# I'll change it to zero.
aux[('salary','std')][('HR','VP')]=0
aux[('salary','std')][('IT','VP')]=0
aux[('salary','std')][('IT','associate')]=0
display(aux)

/var/folders/0l/6vrgp2zn3_151qtvdl8wpjcr0000gn/T/ipykernel_17778/3893241581.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  aux[('salary','std')][('HR','VP')]=0
/var/folders/0l/6vrgp2zn3_151qtvdl8wpjcr0000gn/T/ipykernel_17778/3893241581.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  aux[('salary','std')][('IT','VP')]=0
/var/folders/0l/6vrgp2zn3_151qtvdl8wpjcr0000gn/T/ipykernel_17778/3893241581.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  aux[('salary','std')][('IT','associate')]=0

                     salary
                     median min max       std
department title
HR         VP          70.0  70  70  0.000000
           analyst     32.5  30  35  3.535534
IT         VP          70.0  70  70  0.000000
           analyst     32.5  30  35  3.535534
           associate   60.0  60  60  0.000000
Sales      associate   55.0  55  55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [54]:
# groupby
display(employee.groupby(['department']).agg({'salary':['count',sum]}))
# pivot tables
display(employee.pivot_table(index = ['department'],values = ['salary'], aggfunc = {'salary':['count',sum]}))

           salary
            count  sum
department
HR              3  135
IT              4  195
Sales           2  110

           salary
            count  sum
department
HR              3  135
IT              4  195
Sales           2  110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [56]:
# groupby
display(employee.groupby(['department','title']).agg({'salary':np.mean,'years':sum}))
# pivot tables
display(employee.pivot_table(index = ['department','title'],values = ['salary','years'], aggfunc = {'salary':np.mean,'years':sum}))

                      salary  years
department title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7
Sales      associate    55.0      5

                      salary  years
department title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7
Sales      associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [107]:
def removing_max_salaries(data):
    maximas = data.groupby(['department']).agg({'salary':max})
    for i,worker in data.iterrows():
        for dep,max_sal in maximas.iterrows():
            if worker['department'] == dep and worker['salary']==max_sal[0]:
                data=data.drop(labels=i,axis=0)
    return data
bonus_employee = removing_max_salaries(employee)

In [108]:
display(bonus_employee.groupby(['department']).agg({'salary':np.average}))
display(bonus_employee.pivot_table(index = ['department'],values = ['salary'], aggfunc = ['mean']))

               salary
department
HR          32.500000
IT          41.666667

                 mean
               salary
department
HR          32.500000
IT          41.666667